# ChillerType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WaterLoopData..::..ChillerType Property
WaterLoopData Class See Also
---
The type of water chiller. Note this property change would reset the condenser water loop.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public WaterChillerType ChillerType { get; set; }
```

Visual Basic
---
```text
Public Property ChillerType As WaterChillerType
	Get
	Set
```

Visual C++
---
```text
public:
property WaterChillerType ChillerType {
	WaterChillerType get ();
	void set (WaterChillerType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
WaterLoopData Class
Autodesk.Revit.DB.Mechanical Namespace